app/controllers/chat_rooms_controller.rb

  def index
    @chat_rooms = current_user.rooms
    @message = Message.new
    @chat_room = ChatRoom.includes(:messages).find_by(id: params[:id])
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = 1

  def show
    @chat_room = ChatRoom.includes(:messages).find_by(id: params[:id])
---
SELECT  "chat_rooms".* FROM "chat_rooms" WHERE "chat_rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "messages".* FROM "messages" WHERE "messages"."chat_room_id" = 1

  def create
    @chat_room = current_user.chat_rooms.build(chat_room_params)
    if @chat_room.save
---
INSERT INTO "chat_rooms" ("title", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Chat numero 1"], ["user_id", 1], ["created_at", 2016-12-20 17:06:40 UTC], ["updated_at", 2016-12-20 17:06:40 UTC]]